Lab_5/app/views/articles/index.html.erb

SELECT  "branches".* FROM "branches" WHERE "branches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= article.branch_id %></td>
        <td><%= Branch.find(article.branch_id).name %></td>
        <td><%= article.author_id %></td>
        <td><%= Author.find(article.author_id).name %></td>